================================================================================
1
================================================================================
> Hello
--------------------------------------------------------------------------------
(document
  (section
    (pandoc_block_quote
      (block_quote_marker)
      (pandoc_paragraph
        (pandoc_str)))))
================================================================================
2
================================================================================
> > Hello
--------------------------------------------------------------------------------
(document
  (section
    (pandoc_block_quote
      (block_quote_marker)
      (pandoc_block_quote
        (block_quote_marker)
        (pandoc_paragraph
          (pandoc_str))))))
================================================================================
3
================================================================================
> 1
>
> > 2
>
> 3
--------------------------------------------------------------------------------
(document
  (section
    (pandoc_block_quote
      (block_quote_marker)
      (pandoc_paragraph
        (pandoc_str)
        (block_continuation))
      (block_continuation)
      (pandoc_block_quote
        (block_quote_marker)
        (pandoc_paragraph
          (pandoc_str)
          (block_continuation)))
      (block_continuation)
      (pandoc_paragraph
        (pandoc_str)))))
================================================================================
4 (softbreaks ignore block structure; but don't start continuation line with 1)
================================================================================
> 2
\1
--------------------------------------------------------------------------------
(document
  (section
    (pandoc_block_quote
      (block_quote_marker)
      (pandoc_paragraph
        (pandoc_str)
        (pandoc_soft_break)
        (pandoc_str)))))
================================================================================
5
================================================================================
> 2

1
--------------------------------------------------------------------------------
(document
  (section
    (pandoc_block_quote
      (block_quote_marker)
      (pandoc_paragraph
        (pandoc_str)))
    (pandoc_paragraph
      (pandoc_str))))