================================================================================
Code blocks with language specifier
================================================================================

```{python}
print(1)
```

--------------------------------------------------------------------------------

(document
  (section
    (fenced_code_block
      (fenced_code_block_delimiter)
      (language_attribute
        (language))
      (block_continuation)
      (code_fence_content
        (block_continuation))
      (fenced_code_block_delimiter))))

================================================================================
Code blocks with id, class and key-value pairs
================================================================================

```{#id .class key=value}
print(1)
```

--------------------------------------------------------------------------------

(document
  (section
    (fenced_code_block
      (fenced_code_block_delimiter)
      (commonmark_attribute
        (id_specifier)
        (class_specifier)
        (key_value_specifier
          (key_value_key)
          (key_value_value)))
      (block_continuation)
      (code_fence_content
        (block_continuation))
      (fenced_code_block_delimiter))))

================================================================================
Fenced divs
================================================================================
::: {}

Hello, world

:::

--------------------------------------------------------------------------------
(document
  (section
    (fenced_div_block
      (block_continuation)
      (block_continuation)
      (paragraph
        (inline)
        (block_continuation))
      (block_continuation))))
================================================================================
Fenced divs with a space at the closing fence
================================================================================
::: {}

Hello, world

::: 

--------------------------------------------------------------------------------
(document
  (section
    (fenced_div_block
      (block_continuation)
      (block_continuation)
      (paragraph
        (inline)
        (block_continuation))
      (block_continuation))))
================================================================================
Code block with a colon inside
================================================================================
```{python}
print(1:2)
```
--------------------------------------------------------------------------------
(document
  (section
    (fenced_code_block
      (fenced_code_block_delimiter)
      (language_attribute
        (language))
      (block_continuation)
      (code_fence_content
        (block_continuation)))))
================================================================================
A header with three colons inside
================================================================================
# Header with three colons `:::`

--------------------------------------------------------------------------------
(document
  (section
    (atx_heading
      (atx_h1_marker)
      (inline))))
================================================================================
A code cell with three colons at the beginning of a line
================================================================================
```
Here is how you use a fenced div:

::: {.cell}

Your content

:::
```
--------------------------------------------------------------------------------
(document
  (section
    (fenced_code_block
      (fenced_code_block_delimiter)
      (block_continuation)
      (code_fence_content
        (block_continuation)
        (block_continuation)
        (block_continuation)
        (block_continuation)
        (block_continuation)
        (block_continuation)
        (block_continuation)))))
================================================================================
A paragraph that starts with a colon
================================================================================
\: This is a paragraph that starts with a colon.
--------------------------------------------------------------------------------
(document
  (section
    (paragraph
      (inline))))
================================================================================
Empty fenced div 1
================================================================================
::: {#hello}

:::
--------------------------------------------------------------------------------
(document
  (section
    (fenced_div_block
      (commonmark_attribute
        (id_specifier))
      (block_continuation)
      (block_continuation))))
================================================================================
Empty fenced div 2
================================================================================
::: {#hello}
:::
--------------------------------------------------------------------------------
(document
  (section
    (fenced_div_block
      (commonmark_attribute
        (id_specifier))
      (block_continuation))))
================================================================================
Nested empty fenced divs
================================================================================
::: {#hello}
::: {#world}
:::
:::
--------------------------------------------------------------------------------
(document
  (section
    (fenced_div_block
      (commonmark_attribute
        (id_specifier))
      (block_continuation)
      (fenced_div_block
        (commonmark_attribute
          (id_specifier))
        (block_continuation)
        (block_continuation)))))
================================================================================
A fenced div with a paragraph inside a bulleted list
================================================================================
- ::: {}
  Hi

  :::
--------------------------------------------------------------------------------
(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (fenced_div_block
          (block_continuation)
          (paragraph
            (inline)
            (block_continuation))
          (block_continuation))))))
================================================================================
A code block with a single one-character class specifier
================================================================================
```{.c}
printf("hello");
```
--------------------------------------------------------------------------------
(document
  (section
    (fenced_code_block
      (fenced_code_block_delimiter)
      (commonmark_attribute
        (class_specifier))
      (block_continuation)
      (code_fence_content
        (block_continuation)))))
================================================================================
Inline reference id definitions
================================================================================
[^no-way]: this actually worked.
Can we do soft breaks?

And a new para?
--------------------------------------------------------------------------------
(document
  (section
    (inline_ref_def
      (ref_id_specifier)
      (paragraph
        (inline)))
    (paragraph
      (inline))))
================================================================================
Fenced block note definitions
================================================================================
::: ^my-note
This is a note with multiple blocks.

Another paragraph in the note.
:::
--------------------------------------------------------------------------------
(document
  (section
    (note_definition_fenced_block
      (fenced_div_note_id)
      (block_continuation)
      (paragraph
        (inline)
        (block_continuation))
      (block_continuation)
      (paragraph
        (inline)
        (block_continuation)))))
================================================================================
Example list with (@) syntax
================================================================================
(@) First item

(@) Second item

(@) Third item
--------------------------------------------------------------------------------
(document
  (section
    (list
      (list_item
        (list_marker_example)
        (paragraph
          (inline)
          (block_continuation)))
      (list_item
        (list_marker_example)
        (paragraph
          (inline)
          (block_continuation)))
      (list_item
        (list_marker_example)
        (paragraph
          (inline))))))
================================================================================
Multiple example lists separated by text
================================================================================
(@) First item

(@) Second item

Some text in between.

(@) Third item

(@) Fourth item
--------------------------------------------------------------------------------
(document
  (section
    (list
      (list_item
        (list_marker_example)
        (paragraph
          (inline)
          (block_continuation)))
      (list_item
        (list_marker_example)
        (paragraph
          (inline)
          (block_continuation))))
    (paragraph
      (inline))
    (list
      (list_item
        (list_marker_example)
        (paragraph
          (inline)
          (block_continuation)))
      (list_item
        (list_marker_example)
        (paragraph
          (inline))))))
================================================================================
Horizontal rules with blank lines should not be parsed as metadata
================================================================================
First paragraph.

---

Second paragraph.

---

Third paragraph.
--------------------------------------------------------------------------------
(document
  (section
    (paragraph
      (inline))
    (thematic_break)
    (paragraph
      (inline))
    (thematic_break)
    (paragraph
      (inline))))
================================================================================
YAML metadata block should still work
================================================================================
---
title: Test
author: Someone
---

Content paragraph.
--------------------------------------------------------------------------------
(document
  (minus_metadata)
  (section
    (paragraph
      (inline))))
